zhaozhi0810/iic-update-mcu-program-20230506/gd32f103-iap -2023-04-25-for-dg_keys_iic/user/src/ymodem.c
/**
  ******************************************************************************
  * @file    IAP/src/ymodem.c 
  * @author  MCD Application Team
  * @version V3.3.0
  * @date    10/15/2010
  * @brief   This file provides all the software functions related to the ymodem 
  *          protocol.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
  */

/** @addtogroup IAP
  * @{
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "common.h"
#include "gd32f10x_fmc.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t file_name[FILE_NAME_LENGTH];
uint32_t FlashDestination = ApplicationAddress; /* Flash user program offset */
uint16_t PageSize = PAGE_SIZE;

fmc_state_enum FLASHStatus = FMC_READY;
uint32_t RamSource;
extern uint8_t tab_1024[1024];
extern uint8_t md5sum_down[34];  //存放md5值
extern uint8_t is_cpu_update_cmd;   //是rk3399的升级吗？ 非0表示从rk3399下载


/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/


static  int32_t Receive_Byte_from_uart (uint8_t *c, uint32_t timeout)
{
	while (timeout-- > 0)
	{
		if (SerialKeyPressed(c) == 1)
		{
			return 0;
		}
	}
	return -1;
}


static  int32_t Receive_Byte_from_iic0 (uint8_t *c, uint32_t timeout)
{
	return i2c0_Receive(c, 1, timeout);
}

/**
  * @brief  Receive byte from sender
  * @param  c: Character
  * @param  timeout: Timeout
  * @retval 0: Byte received
  *         -1: Timeout
  */
static  int32_t Receive_Byte (uint8_t *c, uint32_t timeout)
{
  	if(!is_cpu_update_cmd)  //表示从调试串口升级
	{
		return Receive_Byte_from_uart(c,timeout);
	}
	else
	{
		return Receive_Byte_from_iic0(c,timeout);
	}
}


static uint32_t Send_Byte_to_uart (uint8_t c)
{
	SerialPutChar(c);
	return 0;
}




/**
  * @brief  Send a byte
  * @param  c: Character
  * @retval 0: Byte sent
  */
static uint32_t Send_Byte (uint8_t c)
{
	if(!is_cpu_update_cmd)  //表示从调试串口升级
	{
		return Send_Byte_to_uart(c);
	}
	else
	{
		return Send_Byte_to_iic0(c);
	}
}



//static int32_t Receive_Packet_from_uart(uint8_t *data, int32_t *length, uint32_t timeout)
//{
//	uint16_t i, packet_size;
//	uint8_t c;
//	*length = 0;
//	if (Receive_Byte(&c, timeout) != 0)
//	{
//		printf("Receive_Byte timeout\r\n");
//		return -1;
//	}
////	printf("Receive_Packet c = %#x\r\n",c);
//	switch (c)
//	{
//		case SOH:
//			packet_size = PACKET_SIZE;
//			break;
//		case STX:
//			packet_size = PACKET_1K_SIZE;
//			break;
//		case EOT:
//			return 0;
//		case CA:
//			if ((Receive_Byte(&c, timeout) == 0) && (c == CA))
//			{
//				*length = -1;
//				return 0;
//			}
//			else
//			{
//				return -1;
//			}
//		case ABORT1:
//		case ABORT2:
//			printf("Receive_Packet c = %#x\r\n",c);
//			return 1;
//		default:
//			return -1;
//	}
//	*data = c;
//	for (i = 1; i < (packet_size + PACKET_OVERHEAD); i ++)
//	{
//	//	printf("for %d\r\n",packet_size + PACKET_OVERHEAD);
//		if (Receive_Byte(data + i, timeout) != 0)
//		{
//			printf("for Receive_Byte error i = %d\r\n",i);
//			return -1;
//		}
//	}
//	if (data[PACKET_SEQNO_INDEX] != ((data[PACKET_SEQNO_COMP_INDEX] ^ 0xff) & 0xff))
//	{
//		printf("error: data[PACKET_SEQNO_INDEX] = %#x\r\n",data[PACKET_SEQNO_INDEX]);
//		return -1;
//	}
//	*length = packet_size;
//	return 0;
//}




//static int32_t Receive_Packet_from_iic(uint8_t *data, int32_t *length, uint32_t timeout)
//{
//	uint16_t i, packet_size;
//	uint8_t c;
//	uint8_t checksum;
//	*length = 0;
//	if (i2c0_Receive(&c, 1, timeout) != 0)
//	{
//		printf("i2c0_Receive timeout\r\n");
//		return -1;
//	}
////	printf("Receive_Packet c = %#x\r\n",c);
//	switch (c)
//	{
//		case SOH:
//			packet_size = PACKET_SIZE;
//			break;
//		case STX:
//			packet_size = PACKET_1K_SIZE;
//			break;
//		case EOT:
//			return 0;
//		case CA:
//			if ((i2c0_Receive(&c, 1, timeout) == 0) && (c == CA))
//			{
//				*length = -1;
//				return 0;
//			}
//			else
//			{
//				return -1;
//			}
//		case ABORT1:
//		case ABORT2:
//			printf("Receive_Packet c = %#x\r\n",c);
//			return 1;
//		default:
//			return -1;
//	}
//	*data = c;
//	checksum = c;
//	for (i = 1; i < (packet_size + PACKET_OVERHEAD); i ++)
//	{
//	//	printf("for %d\r\n",packet_size + PACKET_OVERHEAD);
//		if (i2c0_Receive(data+i, 1, timeout) != 0)
//		{
//			printf("for Receive_Byte error i = %d\r\n",i);
//			return -1;
//		}
//		
//		if(i< packet_size + PACKET_HEADER) //最后的两个字节不参与校验和
//			checksum += data[i];   //计算校验和 
//	}
//	
//	if(checksum != data[packet_size + PACKET_HEADER])
//	{
//		printf("checksum error checksum = %#x,data[%d] = %#x\r\n",checksum,packet_size + PACKET_HEADER,data[packet_size + PACKET_HEADER]);
//		return -1;
//	}
//	
//	if (data[PACKET_SEQNO_INDEX] != ((data[PACKET_SEQNO_COMP_INDEX] ^ 0xff) & 0xff))
//	{
//		printf("error: data[PACKET_SEQNO_INDEX] = %#x\r\n",data[PACKET_SEQNO_INDEX]);
//		return -1;
//	}
//	*length = packet_size;
//	return 0;	
//}


/*
*********************************************************************************************************
*	oˉ êy ??: UpdateCRC16
*	1|?ü?μ?÷: é?′?????μ?CRC?á1? crcIn ?ù?óé?ò???×??úêy?Y????CRC
*	D?    2?: crcIn é?ò?′?CRC?????á1?
*             byte  D?ìí?ó×??ú
*	·μ ?? ?μ: ?T
*********************************************************************************************************
*/
uint16_t UpdateCRC16(uint16_t crcIn, uint8_t byte)
{
  uint32_t crc = crcIn;
  uint32_t in = byte | 0x100;

  do
  {
	crc <<= 1;
	in <<= 1;
	if(in & 0x100)
		++crc;
	if(crc & 0x10000)
		crc ^= 0x1021;
  }while(!(in & 0x10000));

  return crc & 0xffffu;
}

