zhaozhi0810/iic-update-mcu-program-20230506/gd32f103-iap -2023-04-25-for-dg_keys_iic/user/src/ymodem.c
										file_ptr ++;
										
										
										for (i = 0, file_ptr ++; (i < FILE_MD5_LENGTH);i++) //(*file_ptr != '\0') &&&& (*(pdown_md5+i) != '\0') 
										{
											md5sum_down[i] = *(file_ptr+i);
											//printf("*(pdown_md5+i) = %#x,*(file_ptr+i)=%#x,i=%d\r\n",*(pdown_md5+i),*(file_ptr+i),i);
											if(*(pdown_md5+i) != *(file_ptr+i))
											{
												md5_same = 1;  //md5不同，可以升级
											//	break;
											}
										//	j++;
										}
										md5sum_down[i] = '\0';
										printf("md5sum_down = %s\r\n",md5sum_down);
										//printf("j=%d\r\n",j);
										if(!md5_same) //md5一致，不升级
										{										
											/* End session */
											Send_Byte(CA);
											Send_Byte(CA);
										//	printf("md5 is the same, md5 = %s i = %d\r\n",file_ptr,i);											
										//	printf("md5sum_down = %s\r\n",md5sum_down);
										//	printf("pdown_md5 addr = %p\r\n",pdown_md5);
										//	printf("pdown_md5 = %s\r\n",pdown_md5);
											return -4;
										}
										//md5sum_down[i] = '\0';
										/* Test the size of the image to be sent */
										/* Image size is greater than Flash size */
										if (size > (FLASH_IMAGE_SIZE - 1))  //FLASH_SIZE
										{
											printf("size(%d) > (FLASH_IMAGE_SIZE - 1)(%d)\r\n",size , (FLASH_IMAGE_SIZE - 1));
											/* End session */
											Send_Byte(CA);
											Send_Byte(CA);
											return -1;
										}

										/* Erase the needed pages where the user application will be loaded */
										/* Define the number of page to be erased */
										NbrOfPage = FLASH_PagesMask(size);
										printf("NbrOfPage = %d\r\n",NbrOfPage);

										/* Erase the FLASH pages */
										for (EraseCounter = 0; (EraseCounter < NbrOfPage) && (FLASHStatus == FMC_READY); EraseCounter++)
										{
										//	printf("fmc_page_erase\r\n");
											FLASHStatus = fmc_page_erase(FlashDestination + (PageSize * EraseCounter));
										}
										
										Send_Byte(ACK);
										Send_Byte(CRC16);
									}
									/* Filename packet is empty, end session */
									else
									{
										Send_Byte(ACK);
										file_done = 1;
										session_done = 1;
										break;
									}
								}
								/* Data packet */
								else
								{
									//memcpy(buf_ptr, packet_data + PACKET_HEADER, packet_length);
									
									if(packets_received == 1)  //可能下载的不是bin文件
									{
										if (((*(__IO uint32_t*)buf_ptr) & 0xfFFE0000 ) != 0x20000000)
										{
											Send_Byte(CA);
											Send_Byte(CA);
											printf("down file error 1,abort\r\n");
											/* End session */
											
											return -2;
										}
										else if(((*(__IO uint32_t*)(buf_ptr+4)) & 0xfFFffc00 ) != ApplicationAddress)
										{
											Send_Byte(CA);
											Send_Byte(CA);
											printf("down file error 2,abort\r\n");
											/* End session */
											
											return -2;
										}
									}
									
									RamSource = (uint32_t)buf_ptr;
									
									for (j = 0;(j < packet_length) && (FlashDestination <  FlashDestination_const + size);j += 4)
									{
										/* Program the data received into STM32F10x Flash */
										fmc_word_program(FlashDestination, *(uint32_t*)RamSource);
										//printf("fmc_word_program\r\n");
										if (*(uint32_t*)FlashDestination != *(uint32_t*)RamSource)
										{
											/* End session */
											Send_Byte(CA);
											Send_Byte(CA);
											return -2;
										}
										FlashDestination += 4;
										RamSource += 4;
									}
									//printf("fmc_word_program packets_received = %d\r\n",packets_received);
									Send_Byte(ACK);									
								}
								
								packets_received ++;
								session_begin = 1;
							}
						}   //end  switch (packet_length)
						break;
					case 1:    //1: abort by user
						printf("1: abort by user\r\n");
					
						Send_Byte(CA);
						Send_Byte(CA);
						return -3;
					default:    //-1: timeout or packet error
						printf("-1: timeout or packet error\r\n");
											
						if (session_begin > 0)
						{
							errors ++;
							if (errors > MAX_ERRORS)
							{
								printf("errors = %d\r\n",errors);
								Send_Byte(CA);
								Send_Byte(CA);
								return 0;
							}
						}
						else   //从没开始下载，那就设置一个超时时间
						{
							time_out++;
							if(time_out >= 80)
							{
								printf("download timeout\r\n");
								CIRC_RELEASE(g_i2c0_txbuf);  //清空IIC0发送buf
								return 0;
							}
						}
						//调试串口控制中止
						if (SerialKeyPressed_Uart0((uint8_t*)&key))
						{
							if(key == 'a')  //(key == 'c' || key == 'C')  //ctrl + c
							{
								Send_Byte(CA);
								Send_Byte(CA);
								return -3;
							}
						}
						
						Send_Byte(CRC16);
					break;
			}  // end  switch (Receive_Packet
			if (file_done != 0)
			{
				printf("file_done break\r\n");
				break;
			}
		}    //end    for (packets_received = 0
		if (session_done != 0)
		{
			printf("session_done break\r\n");
			break;
		}
	} //end for (session_done = 0
	return (int32_t)size;
}

/**
  * @brief  check response using the ymodem protocol
  * @param  buf: Address of the first byte
  * @retval The size of the file
  */
int32_t Ymodem_CheckResponse(uint8_t c)
{
  return 0;
}

/**
  * @brief  Prepare the first block
  * @param  timeout
  *     0: end of transmission
  */
void Ymodem_PrepareIntialPacket(uint8_t *data, const uint8_t* fileName, uint32_t *length)
{
  uint16_t i, j;
  uint8_t file_ptr[10];
  
  /* Make first three packet */
  data[0] = SOH;
  data[1] = 0x00;
  data[2] = 0xff;
  
  /* Filename packet has valid data */
  for (i = 0; (fileName[i] != '\0') && (i < FILE_NAME_LENGTH);i++)
  {
     data[i + PACKET_HEADER] = fileName[i];
  }

  data[i + PACKET_HEADER] = 0x00;
  
  Int2Str (file_ptr, *length);
  for (j =0, i = i + PACKET_HEADER + 1; file_ptr[j] != '\0' ; )
  {
     data[i++] = file_ptr[j++];
  }
  
  for (j = i; j < PACKET_SIZE + PACKET_HEADER; j++)
  {
    data[j] = 0;
  }
}

/**
  * @brief  Prepare the data packet
  * @param  timeout
  *     0: end of transmission
  */
void Ymodem_PreparePacket(uint8_t *SourceBuf, uint8_t *data, uint8_t pktNo, uint32_t sizeBlk)
{
  uint16_t i, size, packetSize;
  uint8_t* file_ptr;
  
  /* Make first three packet */
  packetSize = sizeBlk >= PACKET_1K_SIZE ? PACKET_1K_SIZE : PACKET_SIZE;
  size = sizeBlk < packetSize ? sizeBlk :packetSize;
  if (packetSize == PACKET_1K_SIZE)
  {
     data[0] = STX;
  }
  else
  {
     data[0] = SOH;
  }
  data[1] = pktNo;
  data[2] = (~pktNo);
  file_ptr = SourceBuf;
  
  /* Filename packet has valid data */
  for (i = PACKET_HEADER; i < size + PACKET_HEADER;i++)
  {
     data[i] = *file_ptr++;
  }
  if ( size  <= packetSize)
  {
    for (i = size + PACKET_HEADER; i < packetSize + PACKET_HEADER; i++)
    {
      data[i] = 0x1A; /* EOF (0x1A) or 0x00 */
    }
  }
}

/**
  * @brief  Update CRC16 for input byte
  * @param  CRC input value 
  * @param  input byte
   * @retval None
  */
//uint16_t UpdateCRC16(uint16_t crcIn, uint8_t byte)
//{
//	uint32_t crc = crcIn;
//	uint32_t in = byte|0x100;
//	do
//	{
//		crc <<= 1;
//		in <<= 1;
//		if(in&0x100)
//			++crc;
//		if(crc&0x10000)
//			crc ^= 0x1021;
//	}
//	while(!(in&0x10000));
//	return crc&0xffffu;
//}


///**
//  * @brief  Cal CRC16 for YModem Packet
//  * @param  data
//  * @param  length
//   * @retval None
//  */
//uint16_t Cal_CRC16(const uint8_t* data, uint32_t size)
//{
//	uint32_t crc = 0;
//	const uint8_t* dataEnd = data+size;
//	while(data<dataEnd)
//		crc = UpdateCRC16(crc,*data++);

//	crc = UpdateCRC16(crc,0);
//	crc = UpdateCRC16(crc,0);
//	
//	return crc&0xffffu;
//}

/**
  * @brief  Cal Check sum for YModem Packet
  * @param  data
  * @param  length
   * @retval None
  */
uint8_t CalChecksum(const uint8_t* data, uint32_t size)
{
	uint32_t sum = 0;
	const uint8_t* dataEnd = data+size;
	
	while(data < dataEnd )
		sum += *data++;
	
	return sum&0xffu;
}

/**
  * @brief  Transmit a data packet using the ymodem protocol
  * @param  data
  * @param  length
   * @retval None
  */
void Ymodem_SendPacket(uint8_t *data, uint16_t length)
{
	uint16_t i;
	i = 0;
	while (i < length)
	{
		Send_Byte(data[i]);
		i++;
	}
}

/**
  * @brief  Transmit a file using the ymodem protocol
  * @param  buf: Address of the first byte
  * @retval The size of the file
  */
uint8_t Ymodem_Transmit (uint8_t *buf, const uint8_t* sendFileName, uint32_t sizeFile)
{  
	uint8_t packet_data[PACKET_1K_SIZE + PACKET_OVERHEAD];
	uint8_t FileName[FILE_NAME_LENGTH];
	uint8_t *buf_ptr, tempCheckSum ;
	uint16_t tempCRC, blkNumber;
	uint8_t receivedC[2], CRC16_F = 0, i;
	uint32_t errors, ackReceived, size = 0, pktSize;

	errors = 0;
	ackReceived = 0;
	for (i = 0; i < (FILE_NAME_LENGTH - 1); i++)
	{
		FileName[i] = sendFileName[i];
	}
	CRC16_F = 1;       

