zhaozhi0810/iic-update-mcu-program-20230506/gd32f103-iap -2023-04-25-for-dg_keys_iic/user/src/ymodem.c
	/* Prepare first block */
	Ymodem_PrepareIntialPacket(&packet_data[0], FileName, &sizeFile);

	do 
	{
		/* Send Packet */
		Ymodem_SendPacket(packet_data, PACKET_SIZE + PACKET_HEADER);
		/* Send CRC or Check Sum based on CRC16_F */
		if (CRC16_F)
		{
			tempCRC = Cal_CRC16(&packet_data[3], PACKET_SIZE);
			Send_Byte(tempCRC >> 8);
			Send_Byte(tempCRC & 0xFF);
		}
		else
		{
			tempCheckSum = CalChecksum (&packet_data[3], PACKET_SIZE);
			Send_Byte(tempCheckSum);
		}

		/* Wait for Ack and 'C' */
		if (Receive_Byte(&receivedC[0], 10000) == 0)  
		{
			if (receivedC[0] == ACK)
			{ 
				/* Packet transfered correctly */
				ackReceived = 1;
			}
		}
		else
		{
			errors++;
		}
	}while (!ackReceived && (errors < 0x0A));
	//end do while
	
	
	if (errors >=  0x0A)
	{
	return errors;
	}
	buf_ptr = buf;
	size = sizeFile;
	blkNumber = 0x01;
	/* Here 1024 bytes package is used to send the packets */


	/* Resend packet if NAK  for a count of 10 else end of commuincation */
	while (size)
	{
	/* Prepare next packet */
	Ymodem_PreparePacket(buf_ptr, &packet_data[0], blkNumber, size);
	ackReceived = 0;
	receivedC[0]= 0;
	errors = 0;
	do
	{
	/* Send next packet */
	if (size >= PACKET_1K_SIZE)
	{
	pktSize = PACKET_1K_SIZE;

	}
	else
	{
	pktSize = PACKET_SIZE;
	}
	Ymodem_SendPacket(packet_data, pktSize + PACKET_HEADER);
	/* Send CRC or Check Sum based on CRC16_F */
	/* Send CRC or Check Sum based on CRC16_F */
	if (CRC16_F)
	{
	tempCRC = Cal_CRC16(&packet_data[3], pktSize);
	Send_Byte(tempCRC >> 8);
	Send_Byte(tempCRC & 0xFF);
	}
	else
	{
	tempCheckSum = CalChecksum (&packet_data[3], pktSize);
	Send_Byte(tempCheckSum);
	}

	/* Wait for Ack */
	if ((Receive_Byte(&receivedC[0], 100000) == 0)  && (receivedC[0] == ACK))
	{
	ackReceived = 1;  
	if (size > pktSize)
	{
	buf_ptr += pktSize;  
	size -= pktSize;
	if (blkNumber == (FLASH_IMAGE_SIZE/1024))
	{
	return 0xFF; /*  error */
	}
	else
	{
	blkNumber++;
	}
	}
	else
	{
	buf_ptr += pktSize;
	size = 0;
	}
	}
	else
	{
	errors++;
	}
	}while(!ackReceived && (errors < 0x0A));
	/* Resend packet if NAK  for a count of 10 else end of commuincation */

	if (errors >=  0x0A)
	{
	return errors;
	}

	}
	ackReceived = 0;
	receivedC[0] = 0x00;
	errors = 0;
	do 
	{
	Send_Byte(EOT);
	/* Send (EOT); */
	/* Wait for Ack */
	if ((Receive_Byte(&receivedC[0], 10000) == 0)  && receivedC[0] == ACK)
	{
	ackReceived = 1;  
	}
	else
	{
	errors++;
	}
	}while (!ackReceived && (errors < 0x0A));

	if (errors >=  0x0A)
	{
	return errors;
	}

	/* Last packet preparation */
	ackReceived = 0;
	receivedC[0] = 0x00;
	errors = 0;

	packet_data[0] = SOH;
	packet_data[1] = 0;
	packet_data [2] = 0xFF;

	for (i = PACKET_HEADER; i < (PACKET_SIZE + PACKET_HEADER); i++)
	{
	packet_data [i] = 0x00;
	}

	do 
	{
	/* Send Packet */
	Ymodem_SendPacket(packet_data, PACKET_SIZE + PACKET_HEADER);
	/* Send CRC or Check Sum based on CRC16_F */
	tempCRC = Cal_CRC16(&packet_data[3], PACKET_SIZE);
	Send_Byte(tempCRC >> 8);
	Send_Byte(tempCRC & 0xFF);

	/* Wait for Ack and 'C' */
	if (Receive_Byte(&receivedC[0], 10000) == 0)  
	{
	if (receivedC[0] == ACK)
	{ 
	/* Packet transfered correctly */
	ackReceived = 1;
	}
	}
	else
	{
	errors++;
	}

	}while (!ackReceived && (errors < 0x0A));
	/* Resend packet if NAK  for a count of 10  else end of commuincation */
	if (errors >=  0x0A)
	{
	return errors;
	}  

	do 
	{
	Send_Byte(EOT);
	/* Send (EOT); */
	/* Wait for Ack */
	if ((Receive_Byte(&receivedC[0], 10000) == 0)  && receivedC[0] == ACK)
	{
	ackReceived = 1;  
	}
	else
	{
	errors++;
	}
	}while (!ackReceived && (errors < 0x0A));

	if (errors >=  0x0A)
	{
	return errors;
	}
	return 0; /* file trasmitted successfully */
}

/**
  * @}
  */

/*******************(C)COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
